// keyboardLayouts.js

export const layouts = {
    йцукен: [
        ["Ё", "1!", "2\"", "3№", "4;", "5%", "6:", "7?", "8*", "9(", "0)", "-_", "=+"],
        ["Tab", "Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ъ", "\\/"],
        ["Caps Lock", "Ф", "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Э", "Enter"],
        ["Shift", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю", ".,", "Shift"],
        ["Space"]
    ],
    qwerty: [
        ["`~", "1!", "2@", "3#", "4$", "5%", "6^", "7&", "8*", "9(", "0)", "-_", "=+"],
        ["Tab", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "[{", "]}"],
        ["Caps Lock", "A", "S", "D", "F", "G", "H", "J", "K", "L", ";:", "'\"", "\\|"],
        ["Shift", "Z", "X", "C", "V", "B", "N", "M", ",<", ".>", "/?", "Shift"],
        ["Space"]
    ]
    // Добавьте другие раскладки здесь
};
